#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/KRT/terraform-gcp-indy-node-gh-validation/runs/run-6SUgVgcnKBdWELGG

Waiting for the plan to start...

Terraform v1.2.3
on linux_amd64
Initializing plugins and modules...
data.google_project.gpc_indy_node: Reading...
data.google_compute_zones.available: Reading...
data.google_compute_image.ubuntu: Reading...
data.google_project.gpc_indy_node: Read complete after 0s [id=projects/trim-epigram-353718]
data.google_compute_image.ubuntu: Read complete after 0s [id=projects/ubuntu-os-pro-cloud/global/images/ubuntu-pro-1604-xenial-v20211213]
data.google_compute_zones.available: Read complete after 0s [id=projects/trim-epigram-353718/regions/us-central1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_resource_policy.snappolicy will be created
  + resource "google_compute_resource_policy" "snappolicy" {
      + id        = (known after apply)
      + name      = "nodesnapweekly"
      + project   = (known after apply)
      + region    = "us-central1"
      + self_link = (known after apply)

      + snapshot_schedule_policy {
          + retention_policy {
              + max_retention_days    = 60
              + on_source_disk_delete = "APPLY_RETENTION_POLICY"
            }

          + schedule {

              + weekly_schedule {
                  + day_of_weeks {
                      + day        = "SATURDAY"
                      + start_time = "04:00"
                    }
                }
            }
        }
    }

  # module.gpc_indy_node[0].google_compute_address.client_external will be created
  + resource "google_compute_address" "client_external" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "node-1-client-external-ip"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = (known after apply)
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.gpc_indy_node[0].google_compute_disk.data_disk will be created
  + resource "google_compute_disk" "data_disk" {
      + creation_timestamp        = (known after apply)
      + id                        = (known after apply)
      + label_fingerprint         = (known after apply)
      + last_attach_timestamp     = (known after apply)
      + last_detach_timestamp     = (known after apply)
      + name                      = "node-1datadisk"
      + physical_block_size_bytes = 4096
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + size                      = 250
      + source_image_id           = (known after apply)
      + source_snapshot_id        = (known after apply)
      + type                      = "pd-ssd"
      + users                     = (known after apply)
      + zone                      = "us-central1-a"
    }

  # module.gpc_indy_node[0].google_compute_disk_resource_policy_attachment.data_disk will be created
  + resource "google_compute_disk_resource_policy_attachment" "data_disk" {
      + disk    = "node-1datadisk"
      + id      = (known after apply)
      + name    = "nodesnapweekly"
      + project = (known after apply)
      + zone    = "us-central1-a"
    }

  # module.gpc_indy_node[0].google_compute_firewall.firewall_client_port will be created
  + resource "google_compute_firewall" "firewall_client_port" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "node-1-client-access-9702"
      + network            = "node-1-client-vpc-9702"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "9702",
            ]
          + protocol = "tcp"
        }
    }

  # module.gpc_indy_node[0].google_compute_firewall.firewall_ssh will be created
  + resource "google_compute_firewall" "firewall_ssh" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "node-1-ssh-for-admin-access"
      + network            = "node-1-client-vpc-9702"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "9702",
            ]
          + protocol = "tcp"
        }
    }

  # module.gpc_indy_node[0].google_compute_firewall.nodes_access will be created
  + resource "google_compute_firewall" "nodes_access" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "node-1-node-access-9701"
      + network            = "node-1-node-vpc-9701"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "9701",
            ]
          + protocol = "tcp"
        }
    }

  # module.gpc_indy_node[0].google_compute_instance.indynode will be created
  + resource "google_compute_instance" "indynode" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "n1-standard-2"
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "node-1"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + tags_fingerprint          = (known after apply)
      + zone                      = "us-central1-a"

      + attached_disk {
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)
        }

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "projects/ubuntu-os-pro-cloud/global/images/ubuntu-pro-1604-xenial-v20211213"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "node-1-client-subnet-9702"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "node-1-client-node-9701"
          + subnetwork_project = (known after apply)
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + min_node_cpus       = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)
          + provisioning_model  = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # module.gpc_indy_node[0].google_compute_network.vpc_client_network will be created
  + resource "google_compute_network" "vpc_client_network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "node-1-client-vpc-9702"
      + project                         = (known after apply)
      + routing_mode                    = "REGIONAL"
      + self_link                       = (known after apply)
    }

  # module.gpc_indy_node[0].google_compute_network.vpc_node_network will be created
  + resource "google_compute_network" "vpc_node_network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "node-1-node-vpc-9701"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # module.gpc_indy_node[0].google_compute_subnetwork.client will be created
  + resource "google_compute_subnetwork" "client" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.0.2.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "node-1-client-subnet-9702"
      + network                    = "node-1-client-vpc-9702"
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.gpc_indy_node[0].google_compute_subnetwork.node will be created
  + resource "google_compute_subnetwork" "node" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.0.1.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "node-1-client-node-9701"
      + network                    = "node-1-node-vpc-9701"
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.gpc_indy_node[1].google_compute_address.client_external will be created
  + resource "google_compute_address" "client_external" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "node-2-client-external-ip"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = (known after apply)
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.gpc_indy_node[1].google_compute_disk.data_disk will be created
  + resource "google_compute_disk" "data_disk" {
      + creation_timestamp        = (known after apply)
      + id                        = (known after apply)
      + label_fingerprint         = (known after apply)
      + last_attach_timestamp     = (known after apply)
      + last_detach_timestamp     = (known after apply)
      + name                      = "node-2datadisk"
      + physical_block_size_bytes = 4096
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + size                      = 250
      + source_image_id           = (known after apply)
      + source_snapshot_id        = (known after apply)
      + type                      = "pd-ssd"
      + users                     = (known after apply)
      + zone                      = "us-central1-b"
    }

  # module.gpc_indy_node[1].google_compute_disk_resource_policy_attachment.data_disk will be created
  + resource "google_compute_disk_resource_policy_attachment" "data_disk" {
      + disk    = "node-2datadisk"
      + id      = (known after apply)
      + name    = "nodesnapweekly"
      + project = (known after apply)
      + zone    = "us-central1-b"
    }

  # module.gpc_indy_node[1].google_compute_firewall.firewall_client_port will be created
  + resource "google_compute_firewall" "firewall_client_port" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "node-2-client-access-9702"
      + network            = "node-2-client-vpc-9702"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "9702",
            ]
          + protocol = "tcp"
        }
    }

  # module.gpc_indy_node[1].google_compute_firewall.firewall_ssh will be created
  + resource "google_compute_firewall" "firewall_ssh" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "node-2-ssh-for-admin-access"
      + network            = "node-2-client-vpc-9702"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "9702",
            ]
          + protocol = "tcp"
        }
    }

  # module.gpc_indy_node[1].google_compute_firewall.nodes_access will be created
  + resource "google_compute_firewall" "nodes_access" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "node-2-node-access-9701"
      + network            = "node-2-node-vpc-9701"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "9701",
            ]
          + protocol = "tcp"
        }
    }

  # module.gpc_indy_node[1].google_compute_instance.indynode will be created
  + resource "google_compute_instance" "indynode" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + guest_accelerator         = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + machine_type              = "n1-standard-2"
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "node-2"
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + tags_fingerprint          = (known after apply)
      + zone                      = "us-central1-b"

      + attached_disk {
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)
        }

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "projects/ubuntu-os-pro-cloud/global/images/ubuntu-pro-1604-xenial-v20211213"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "node-2-client-subnet-9702"
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = "node-2-client-node-9701"
          + subnetwork_project = (known after apply)
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + min_node_cpus       = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)
          + provisioning_model  = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # module.gpc_indy_node[1].google_compute_network.vpc_client_network will be created
  + resource "google_compute_network" "vpc_client_network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "node-2-client-vpc-9702"
      + project                         = (known after apply)
      + routing_mode                    = "REGIONAL"
      + self_link                       = (known after apply)
    }

  # module.gpc_indy_node[1].google_compute_network.vpc_node_network will be created
  + resource "google_compute_network" "vpc_node_network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "node-2-node-vpc-9701"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # module.gpc_indy_node[1].google_compute_subnetwork.client will be created
  + resource "google_compute_subnetwork" "client" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.0.2.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "node-2-client-subnet-9702"
      + network                    = "node-2-client-vpc-9702"
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.gpc_indy_node[1].google_compute_subnetwork.node will be created
  + resource "google_compute_subnetwork" "node" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.0.1.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "node-2-client-node-9701"
      + network                    = "node-2-node-vpc-9701"
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

Plan: 23 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @kinwolfqc, Action: `pull_request`*